%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% 
%% Неделя 6
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
clc
clear
N=100;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
x=1.5; r=0.1;
v=r*randn(1,N);                                                            %%%%%% случайные величны с гауссовским распределением 
y=x*ones(1,N)+v;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
X_Prior=2; Var_Prior=1;                                                    %%%%%%%%%%%%% Априорное распределение X

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
j=1;
for Var_Prior=0.005:0.02:0.1; 
for i=1:N
x_Est(j,i)= X_Prior+(Var_Prior/(Var_Prior+(1/i)*r^2))*(sum(y(1:i))/i-X_Prior);
end
j=j+1;
end
for i=1:N
x_Est(j,i)=sum(y(1:i))/i;                                                  %%%%%%%%%%%%% Оценки при бесконечной априорной дисперсии X
end


figure(1)
plot(1:N,x*ones(1,N),'r',1:N,y,'b');
hold on; grid;
legend('Истинная велична','Измерения')
figure(2)
plot(1:N,x*ones(1,N),'r.',1:N,X_Prior*ones(1,N),'b*',1:N,x_Est(j,:),'g*',1:N,x_Est)
hold on; grid;
legend('Истинная велична','Оценки при \sigma^2_0=0','Оценки при \sigma^2_0=\infty','Оценки при 0< \sigma^2_0<\infty')