%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% Неделя 5
%% Оценивание с использованием метода максимума функции правдоподобия
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

clear; close all;

%% Моделирование измерений %%
%количество измерений
mn=100;
%истинное значение величины
x_true=randn*10;
v=rand(1,mn)-0.5;  %случайные величны с равномерным распределением (-0,5  0,5)
y=x_true*ones(1,mn)+v;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%Выделение памяти
x_ma=zeros(1,mn);                                   
      

%% Оценивание %%
for i=1:mn
x_ma(i)= (1/i)*sum(y(1:i)); %Среднее арифметическое (для сравнения)
x_MLE_Up(i)=min(y(1:i))+0.5;
x_MLE_Down(i)=max(y(1:i))-0.5;
end

%% Графики %%

figure(1)
plot(1:mn,y,'b.',1:mn,x_true*ones(1,mn),...
    'r.',1:mn,x_ma,1:mn,x_MLE_Up,'g',1:mn,x_MLE_Down,'g');
hold on; grid;
legend('Измерения','Истинное значение','Среднее арифметическое','границы оценки МФП');
title('Оценивание по методу максимума функции правдоподобия');
