%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% 
%% Неделя 5
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

N=100;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
x=1.5;
v=rand(1,N)-0.5;                                                              %%%%%% случайные величны с равномерным распределением (-0,5  0,5)
y=x*ones(1,N)+v;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
                                                                            %Комментарии одинаковые
x_Est1=zeros(1,N);                                                            %%%%%%%%%%%%% Оценка по варианту 1
x_Est2_Up=zeros(1,N);x_Est2_Down=zeros(1,N);                                  %%%%%%%%%%%%% Оценка по варианту 1
x_Est3=zeros(1,N);                                                            %%%%%%%%%%%%% Оценка по варианту 1
x_Est4_Up=zeros(1,N); x_Est4_Down=zeros(1,N);                                 %%%%%%%%%%%%% Оценка по варианту 1
x_Est5=zeros(1,N);                                                            %%%%%%%%%%%%% Оценка по варианту 1

%%%%%%%%%%%%% Оценка по варианту 1
for i=1:N
x_Est1(i)= (1/i)*sum(y(1:i));
x_Est2_Up(i)=min(y(1:i))+0.5;
x_Est2_Down(i)=max(y(1:i))-0.5;
x_Est3(i)=median(y(1:i));
x_Est4_Up(i)=-min(y(1:i))+0.5;
x_Est4_Down(i)=max(y(1:i))+0.5;
x_Est5(i)=0.25*sum(y(1:i))/i;
end
figure(1)
plot(1:N,y,'b');
legend('measurements')
figure(2)
plot(1:N,x*ones(1,N),'r.',1:N,x_Est1,'b',1:N,x_Est2_Up,'g',1:N,x_Est2_Down,'g')
hold on; grid;
legend('Истинная велична','Среднее арифметическое','границы оценки МФП')