%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% Неделя 6.
%% Использование байесовского подхода при
%% различных значениях априорной неопределенности
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
clear;

%% Моделирование измерений %%
%априорное математическое ожидание
x_exp = 1e2*randn;
%дисперсия априорной оценки
x_var = 1e10;
%x_var = 1e-10;

%истинное значение величины
x_true = 3.14;

%количество измерений
mn = 100;

%Дисперсия измерений
m_var = 10;

%Моделирование
x_m = x_true+sqrt(m_var)*randn(1,mn);

x_est = zeros(1,mn);
%% Оценивание %%
for i=1:mn
x_est(i) = (x_exp+(x_var/(x_var+(1/i)*m_var))*(sum(x_m(1:i)-x_exp))/i);
end
    
%% Графики %%

figure(1); clf;
hold on; grid;
plot(x_m,'*');
plot(1:mn,x_est);
plot(x_exp,'or');
legend('measurements','estimate','x exp')

